data_generation/simulation_results/of/case_48/constant/simParams
nIter 2000;
hComponent0 671.5781358696752;
hComponent1 1491.3610792862735;
hComponent2 1352.9074386255868;
hComponent3 1231.2747418177337;
hComponent4 1075.268353125884;kComponent0 86.57559762186463;
kComponent1 57.97112366773661;
kComponent2 70.57970759331133;
kComponent3 38.85508361121869;
kComponent4 22.910640594669275;
tAmbient 300;
Ux 2.2903550789989184;
kPCB 0.5922230121482506;